app/controllers/city_controller.rb

SELECT "cities".* FROM "cities"
---
	def index
		render json: City.all