app/controllers/neighborhood_controller.rb

	def index
		render json: Neighborhood.all
---
SELECT "neighborhoods".* FROM "neighborhoods"

	def getNeighborhoodsByCity
		@neighborhoods = Neighborhood.where(city_id: params[:city_id])
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."city_id" = ?  [["city_id", 1]]

	def getNeighborhoodsByBorough
		@neighborhoods = Neighborhood.where(borough: params[:borough])
---
SELECT "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."borough" = ?  [["borough", "Brooklyn"]]